{
    "data": [
        {
            "name": "Carrot",
            "watering": "Vegetable",
            "photo": "https://media.istockphoto.com/photos/carrot-plant-in-soil-picture-id157684488?k=20&m=157684488&s=612x612&w=0&h=qic6SmUHHam8jwYb8e0FqN54pMTV2FM5JTWeERcCVg4=",
            "description": "",
            "soil": "Carrots will grow best in loose soil that is full of organic matter and well-decomposed compost. Carrots enjoy a pH of 6.0 to 6.5. They do not grow robustly in very acidic soil or soil that is too rich in nitrogen.",
            "climate": "Carrots grow best in cool temperatures of early spring and late fall. Night temperatures of 13 degrees C and day temperatures of 24 degrees C are ideal for carrots. High temperatures cause poorly colored, low-quality carrots.",
            "sowing_time": "For summer cultivation, it can be done from January to April, for winter, from August to the end of September.",
            "harvest_time": "Usually, from the day you sow them, it takes 3 – 4 months to harvest. Of course, carrot picking can be done earlier as long as they have grown to a satisfactory size for you.",
            "height": "5.1 to 30cm for roots, 30cm for green tops ",
            "utilization": ""
        },
        {
            "name": "Papaya",
            "watering": "Vegetable",
            "photo": "https://d9-wret.s3.us-west-2.amazonaws.com/assets/palladium/production/s3fs-public/Biomes_AgriculturalLandWater_00041.jpg",
            "description": "",
            "soil": "Papaya grows well in well-drained rich sandy loam soils with a depth of 45cm or medium black soils free from water logging. Light soils with pH between 6.5-7 are very good for papaya, if they are adequately manured. ",
            "climate": "Papaya is a tropical crop but it does well in a mild tropical climate. It grows well from sea level upto an altitude of 1000m. Papaya should not be grown in areas with strong, hot or dry winds. Dry climate at the time of ripening adds to the sweetness of fruits. Ideal temperature for growing papaya is between 25-30 oC while temperatures below 10 oC delays ripening. In high rainfall areas are not suitable for growing papaya due to the death of the plants by collar- rot disease.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Beans",
            "watering": "Vegetable",
            "photo": "https://thumbs.dreamstime.com/b/carrots-fresh-soil-old-weathered-wood-40673900.jpg",
            "description": "",
            "soil": "Beans grow best in slightly acidic to neutral soil, pH between 6 and 7. Clay or silt loams are better for bean production than sandy soils, although good drainage is important. Use well-rotted manure or compost at planting to increase soil organic matter.",
            "climate": "Beans require a fairly narrow temperature range in order to maximise productivity. Yields can be 6t/ha at optimum temperatures of 15-21C. Above 28oC, pollen viability is decreased resulting in flower bud drop and reduced pod formation. Pods are also more likely to be fibrous, lacking good flavour and texture.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Oranges",
            "watering": "Vegetable",
            "photo": "https://cdn.shopify.com/s/files/1/0059/8835/2052/products/Calomondin_1_FGT_650x.jpg?v=1611183556",
            "description": "",
            "soil": "Orange trees can grow in a variety of soil. For optimal growth and health, you'll want a soil with good drainage and a soil pH between 5.0 to 6.5. You'll also want a soil rich in loam, which is a combination of sand, silt, and clay.Commercial potting mixes with peat moss, perlite, vermiculite and compost are fine to use as long as the soil is light enough to drain water well.",
            "climate": "Like most citrus plants, oranges do well under moderate temperatures between 15.5 and 29 °C and require considerable amounts of sunshine and water.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Lemons",
            "watering": "Vegetable",
            "photo": "https://i.redd.it/svp8y9byf3x51.jpg",
            "description": "",
            "soil": "Lemon trees can grow in almost any type of soil, as long as it boasts good drainage. They prefer a soil pH between 5.5 and 6.5 and thrive in a loamy or sandy mixture.A regular potting mix is equal parts garden soil, cocopeat and compost.The ideal soil for lemon tree is a rich and well-drained sandy loam. Drained loam or Sandy Loam is the soil typically used for gardening because it produces more nutrients and moisture that can help the tree to grow vigorously.",
            "climate": "Lemon trees thrive in temperatures between 25 and 30 degrees Celsius, but tolerate the high temperatures experienced in citrus regions.As a citrus variety, lemon trees require full sun, which means about 6 to 8 hours of direct sunlight daily. For indoor growth, simply place them in front of a sunny window. ",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Berries",
            "watering": "Vegetable",
            "photo": "https://i.ytimg.com/vi/VDJiyEl4QLU/sddefault.jpg",
            "description": "",
            "soil": "The berry tree has no particular preferences as to the type of soil, it even tolerates dry and coastal areas. It thrives best in fertile soils, which have a high content of organic matter and ensure good drainage.Berry trees prefer well-draining, moist, loamy soil with a pH between 5.5-7. However, they can also grow in sandy and clay soil.",
            "climate": "All in all, berries can be a fussy crop to grow in a hot, dry climate. Berries tend to be more prevalent in cooler regions of the world, with high amounts of annual rainfall. Even though a hot climate isn't ideal for growing berries, it can be done depending on the variety and the work you're willing to put in to it.The berry tree loves sunny spots in the garden that are not relatively protected from strong winds. It is very resistant to the cold and frost of winter, as well as to high concentrations of atmospheric pollution, which is why it is very common on city streets.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Olives",
            "watering": "Vegetable",
            "photo": "https://www.bizartgallery.com/products_img/1412873458_0.jpeg",
            "description": "",
            "soil": "Olive trees like extremely well-draining, rocky soil. Plant your tree in a mix of potting soil and perlite or small rocks. When selecting a container, opt for clay or wood. Plastic containers retain more water, which can be deadly for an olive tree.The tree will tolerate harsh conditions, including steep stony soils, where few other plants will survive. However, they do not like heavy soils that hold water and prefer neutral rather than alkaline soils (a pH of 7.0-8.0 is optimal).",
            "climate": "Olive trees require a Mediterranean-like climate to survive. They need a long, hot summer and a cool, not frigid, winter. A mature tree can survive temperatures down to 15 degrees Fahrenheit for a limited amount of time; sustained cold below 15 degrees can be fatal.What land conditions are favorable to grow olives?  Olive trees need a subtropical climate and do best with mild winters and long, warm, and dry summers. They are sensitive to hard freezing environments. ",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Red Apples",
            "watering": "Vegetable",
            "photo": "http://www.todayifoundout.com/wp-content/uploads/2014/02/apple-tree.jpg",
            "description": "",
            "soil": "The tree grows well in acidic, well-drained and humid soils. Generally, the soil must be porous and supplemented with hay or some other organic material to keep it moist and full of nutrients.Apples trees can grow in a wide range of soils from medium textured clays to gravelly sands. However, poor soils will produce poor results and the best crops are found on fertile sandy soils and loams. Soils should be well drained.",
            "climate": "Even though apple trees can grow in almost any hardiness zone, apples grow best in climates where it's cold in winter, moderate in summer and has medium to high humidity. They can tolerate winter temperatures as low as - 4,5 degrees Celsius.Red delicious apple trees are sun loving and need a minimum six hours of direct, unfiltered sunlight each day.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Blood Oranges",
            "watering": "Vegetable",
            "photo": "https://www.firstchoiceproduce.com/wp-content/uploads/2021/03/blood-orange-tree-e1617019176846.png",
            "description": "",
            "soil": "Like all citrus, blood oranges need full sun and deep, free-draining soil with lots of compost. Slightly acidic soil and shelter from strong winds enhances performance. They can be planted at any time of year and all young fruit should be removed for the first two years.",
            "climate": "Blood oranges need a warm temperate to subtropical climate. They prefer hot summers and mild, dry winters – seasonal conditions that promote fruit colouration. ",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Cherries",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2015/05/cherry-trees.jpg",
            "description": "",
            "soil": "Prefers deep, well-drained soils enriched with compost and decomposed manure.All Cherries prefer deep, fertile and well-drained soil that is ideally slightly acidic, with a pH 6.5-6.7. They dislike shallow, sandy or poorly drained soil. They can be planted in an open site, such as a lawn, or trained flat against a wall or fence.",
            "climate": " Prefers cool climates, but will grow in warm, arid and semi-arid climates.Some types of cherries will succeed in tropical areas. Cherry trees fall into the category of stone fruits, which require a certain number of hours of cold weather in winter in order to set fruit.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Cranberries",
            "watering": "Vegetable",
            "photo": "https://cdn.shopify.com/s/files/1/0596/7927/7230/products/il_fullxfull.2828605743_pkc5_a33df010-d2e9-4cba-bb9b-365036eb8bfb_1024x1024@2x.jpg?v=1631678264",
            "description": "",
            "soil": "They can grow and survive only under a very special combination of factors. These factors include acid peat soil.Cranberries grow on low-lying vines in beds layered with sand, peat, gravel and clay.The ideal pH for cranberries is 4.2-5.5, which is quite acidic com- pared to other crops. If the soil is higher than 5.5, the availability of nutrients dramatically changes.",
            "climate": "Cranberries require three months of chilly winter weather at 0°to 7.5°C to ensure flower set and fruiting in spring. Plant cranberries in full sun but not in a location that gets too hot; a south-facing location is not optimal.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Red Grapes",
            "watering": "Vegetable",
            "photo": "https://www.healthbenefitstimes.com/9/gallery/red-grapes/Red-Grapes-farming.png",
            "description": "",
            "soil": "Loam Soil. Most experts suggest loamy soil as the best type of soil for grape growing. A crumbly mix of sand, silt, and clay when blended with other soils in the right amounts offers the ideal soil type for grape growing.",
            "climate": "Grapevines thrive best in climates with long warm summers, and rainy winters. Warm weather during the growing period enables grapevine to flower, fruit set and ripen.Grapevines do best with full sun - about 7 or 8 hours per day. Less light leads to lower fruit production, poorer fruit quality, increased powdery mildew, and fruit rot.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Pink / Red Grapefruit",
            "watering": "Vegetable",
            "photo": "https://image.shutterstock.com/image-photo/grapefruit-tree-citrus-x-paradisi-260nw-735993109.jpg",
            "description": "",
            "soil": "Soil – both standard and dwarf Grapefruit trees flourish in well-draining, loamy soil. Avoid planting your trees, in soil that is clay laden or high in salinity as these types of soil can inhibit the growth of citrus trees.Grapefruit trees also prefer well-draining, loamy soil. Always get the planting area ready beforehand, amending the soil if necessary.",
            "climate": "Requirements Grapefruit is a tropical to subtropical plant and the trees grow best in areas with hot daytime temperatures and warm to hot night time temperatures. Grapefruit is less hardy than orange but continual exposure to cooler temperatures will induce a certain degree of cold tolerance. Red grapefruits, like other varieties of this subtropical citrus, appreciate warm climates. Red grapefruit trees need full sun to thrive, so make sure to plant somewhere they receive 8 or more hours of direct light.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Red Pears",
            "watering": "Vegetable",
            "photo": "https://cdn.harvesttotable.com/htt/2010/12/23190838/Pear-tree1.jpg",
            "description": "",
            "soil": "Pears can grow in loamy, sandy or clay soils, though they do best in rich, loamy soil. Clay soils are heavy and tend to drain slowly, while sandy soils are less able to retain moisture. Clay soils may be rich in nutrients, but too much water retention can cause problems with root rots and lack of oxygen for the tree. Loamy soil generally holds water without becoming waterlogged, and has more available oxygen and nutrients for the tree's roots to absorb. The trees require well-drained soil, and prefer loam with a pH level of 6.0 to 7.0.",
            "climate": "Pear trees must receive ample winter cold in order to produce flowers, they also need full sun. Most popular varieties thrive in regions where the temperature rarely increases well above 32°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Pomegranates",
            "watering": "Vegetable",
            "photo": "https://www.garden.eco/wp-content/uploads/2018/08/what-do-pomegranates-grow-on-2.jpg",
            "description": "",
            "soil": "Pomegranate can be grown on a wide range of soils. However, it grows well in medium deep, loamy and well-drained soils having a pH of 7.5. Heavy soils with poor drainage facilities are unsuitable for its cultivation.",
            "climate": "Pomegranates can be grown in mild-temperate to tropical climates. However, the best quality pomegranate fruit are produced in regions with cool winters and hot, dry summers (Mediterranean climate). Pomegranate is more cold hardy than citrus. Favorable temperatures for professional planting and cultivation of Pomegranate are those ranging between 5 and 38 °C, while the optimum temperature range is between 23 and 32 °C. As for minimum temperature rates, most Pomegranate varieties are not recommended for planting in those areas where temperatures fall below -10 °C in winter. It withstands temperatures that often exceed 38 to 40 °C, and can withstand temperatures of 48 °C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Raspberries",
            "watering": "Vegetable",
            "photo": "http://cdn.shopify.com/s/files/1/0059/8835/2052/products/Raspberry_Shortcake_2_grande.jpg?v=1618584962",
            "description": "",
            "soil": "Raspberries thrive in moisture-retentive, fertile, slightly acidic soil (ideally pH 6.5–6.7), which is well-drained and weed free. They dislike soggy soil and shallow chalky soil.",
            "climate": "Raspberries do best in areas with cool or cold climates. They may also grow in temperate climates, provided summers are mild (temperatures averaging less than 30°C). Plant them in a sunny spot with 6-8 hours of sunlight and ideally, sheltered from hot drying winds and the harsh westerly sun.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Strawberries",
            "watering": "Vegetable",
            "photo": "https://strawberryplants.org/wp-content/uploads/How-Fast-Do-Strawberry-Plants-Grow-featured.jpg",
            "description": "",
            "soil": "Strawberries grow best in a deep, sandy loam soil rich in organic matter. The soil must be well-drained. Keep away from areas that remain wet late into the spring. Strawberries grow best in loamy or sandy soils. Before planting, prepare the soil by incorporating 5 to 7.5 cm of compost or other organic matter to a depth of at least 30 cm. Organic matter improves nutrient availability as well as the soil's structure and water-holding capacity.",
            "climate": "Strawberries prefer sunny conditions, with a warmer northerly aspect giving earlier fruit. They need shelter from early frosts and hot summer winds, and may want some shade from afternoon sun in hot summer climates. They are happy growing in either containers or beds. Strawberry grows well under temperate climate. Some cultivars can be grown in sub-tropical climate. Daylight period of 12 hrs. or less and moderate temperature are important for flower-bud formation.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Watermelon",
            "watering": "Vegetable",
            "photo": "https://st2.depositphotos.com/1513934/11876/i/950/depositphotos_118760662-stock-photo-watermelon-plant-in-the-garden.jpg",
            "description": "",
            "soil": "Watermelons do best in loamy, somewhat-sandy, well-drained soil. They can struggle in soil that contains too much clay and doesn't drain well. Watermelons prefer a soil pH between 6.0 and 7.5 (“slightly acidic to neutral”). Watermelons need a lot of space—up to 1.85 m² per plant.",
            "climate": "Watermelons like it moderately hot, and they grow their best between 23.8°C and 35°C air temperature. Regardless of what variety you grow in your pots, be sure to site the containers in a location where they receive a minimum of 8 hours of full sun per day. Watermelons will not form flowers or fruits if they don't get enough sun. They can thrive in both humid and semi-arid environments, but may develop fungal foliage diseases in humid areas more frequently than in dry areas.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Beets",
            "watering": "Vegetable",
            "photo": "https://cdn.britannica.com/90/157390-050-68CA2798/beetroot.jpg",
            "description": "",
            "soil": "Beets do best in sandy soil in the spring and heavier soil in the fall because sandy soil warms faster than heavier clay soil. They do not grow well in tight clay. In poorly drained areas, make ridges 10 to 15 cm tall to allow water to drain. Beets don't like acidic soil and may perform poorly in soil with a 5.5 or less pH rating.",
            "climate": "Beetroot grows best between 18 – 25C. It is susceptible to hot temperatures, with 27C potentially causing bolting, poor colour and root shape. In particular, high temperatures can cause light and dark rings to form in the root (zoning) which is undesirable for processing.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Red Peppers",
            "watering": "Vegetable",
            "photo": "https://agravia.gr/wp-content/uploads/2021/03/%CE%9C%CE%B5%CE%BB%CE%AD%CF%84%CE%B7-%CE%95%CF%80%CE%AF%CE%B4%CF%81%CE%B1%CF%83%CE%B7%CF%82-%CE%9B%CE%AF%CF%80%CE%B1%CE%BD%CF%83%CE%B7%CF%82-%CE%A0%CE%B9%CF%80%CE%B5%CF%81%CE%B9%CE%AC.jpg",
            "description": "",
            "soil": "Bell peppers prefer a rich soil that's more sandy or loamy, which keeps your ground conditions well-drained and warm. Bell peppers also like a soil pH between 6.0 and 6.8.",
            "climate": "Bell peppers need full sun to grow and ripen properly, so keep them in a sunny spot —unless you live in a climate susceptible to extremely high heat and intense sunlight, in which case shade cloth or nearby plants can be used to manage temperatures. Peppers thrive when temperatures are warm. Being sensitive to the cold, planting should be delayed until the danger of frost is past in the spring. Ideal temperatures are 21°C to 26.5°C during the day, and 15.5°C to 21°C at night.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Radishes",
            "watering": "Vegetable",
            "photo": "https://media.istockphoto.com/photos/small-garden-radish-picture-id121137414?k=20&m=121137414&s=612x612&w=0&h=N_2voyYZMp4nj0IdfWgFKYBTDugtcWbWFITFxLMX4y8=",
            "description": "",
            "soil": "Radishes prefer fertile, well-drained, deep, sandy soils rich in organic matter for best growth, slightly acidic to neutral soil with pH 6 to 7. Radishes really aren't too picky when it comes to potting soil either, but they will do best in soil that drains well and is high in organic matter. A well-composted organic potting soil will do great.",
            "climate": "Radishes prefer light, sandy loams with pH 6.5 - 7.0, but will tolerate a wide range of soil types. Soils with pH below 6.5 may require liming. Radishes are a cool season crop, preferring temperatures between 4.5-21°C. Optimum temperature range is 15.5-18°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Radicchio",
            "watering": "Vegetable",
            "photo": "https://morningchores.com/wp-content/uploads/2019/04/chicory-3877521_640.jpg",
            "description": "",
            "soil": "Radicchio can tolerate a range of soil types, but loamy, fertile earth is best. Water retention and good drainage are key. If you don't have the right kind of soil naturally, amend your soil with compost or sand.",
            "climate": "Radicchio is frost tolerant for a short period of time and growing temperatures may range as great as from -1 to 32 °C. However, higher temperatures for any length of time will burn the leaves of the radicchio. While the plant prefers plenty of sunlight, it tolerates shade in the garden as well.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Red Onions",
            "watering": "Vegetable",
            "photo": "https://i.pinimg.com/736x/ec/53/41/ec53412e9e197698c37a00626b4b362f--onions-gardening.jpg",
            "description": "",
            "soil": "All onions need plenty of sun and well-draining soil with a pH between 6.0 and 6.8. Red onions grow best in loose, well-drained sandy loam. Onions are easy to grow. They perform best in well-drained, slightly acidic, fertile soils in full sun. Heavy soils can be improved by incorporating organic matter, such as compost, into the soil. Onions require higher fertility levels than most other vegetables.",
            "climate": "Onions are a cool weather crop, so they are not as heat tolerant as tropical plants. Onions are adapted to a wide range of temperatures and they are frost tolerant. Leaf, root, and bulb development occurs in cool temperatures between 12.5° to 23.5°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Red Potatoes",
            "watering": "Vegetable",
            "photo": "https://thefarmgirlblog.com/wp-content/uploads/2018/06/IMG_6687-1.jpg",
            "description": "",
            "soil": "Use well-draining, organic potting soil or compost for best results. Both compost and potting soil can be used when growing red potatoes. Make sure you use organic types to give your potatoes as much nutrients as possible. It is important to use well-draining soil so your potatoes do not get soggy or rotten. Potatoes grow best in well-drained, sandy soil. A poorly drained soil is more likely to produce diseased tubers. The ideal soil pH level for potatoes is somewhat acidic, between 6 and 6.5, but they will tolerate soil with pH as low as 5.",
            "climate": "Potatoes can be grown anywhere from sea level to 13,000 feet.Potatoes can grow in winter as long as they get enough light and are protected from freezes or hard frosts.Red potato plants need seven or eight hours of sunshine, well-drained moist soil and good fertility. Plant potatoes during cool weather when there is no danger of a freeze but when temperatures remain below the mid-26.5 C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Tomatoes",
            "watering": "Vegetable",
            "photo": "https://www.santhionlineplants.com/wp-content/uploads/2020/10/Tomato-Plant-Thakkali.jpg",
            "description": "",
            "soil": "Loam and sandy loam soils are best for tomato production, but these plants will grow in almost all soil types except heavy clay. If your soil has lots of clay, you can improve the texture by tilling the soil and incorporating sand, sawdust, peat moss or other amendments before planting. The soil pH should be slightly acidic (6.2 to 6.8)",
            "climate": "Tomatoes are known to be a warm season crop. It can survive some cold but is not tolerant to very low temperatures. A top-class tomato crop requires a stable temperature range with minimums and maximums not too far apart. Wide temperature variation often results in poor fruit quality or reduced yields. Tomatoes grow best when the daytime temperature is between 18 and 29 degrees Celsius. They stop growing above 35 degrees Celsius. If nighttime temperatures are above 29 degrees Celsius, the fruit will not turn red.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Apples",
            "watering": "Vegetable",
            "photo": "https://scarpettadolcetto.files.wordpress.com/2010/11/dsc_8766.jpg",
            "description": "",
            "soil": "Growing Golden Delicious apples requires well-drained soil. Like most fruit trees, they prefer not to have soggy soil. Apples trees can grow in a wide range of soils from medium textured clays to gravelly sands. However, poor soils will produce poor results and the best crops are found on fertile sandy soils and loams. Soils should be well drained. Apple trees require full sun, so choose a spot where the sun shines directly on the tree for at least 8 hours each day.",
            "climate": "Even though apple trees can grow in almost any hardiness zone, apples grow best in climates where it's cold in winter, moderate in summer and has medium to high humidity. They can tolerate winter temperatures as low as - 40 degrees Celsius.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Apricots",
            "watering": "Vegetable",
            "photo": "https://previews.123rf.com/images/openlens/openlens1011/openlens101100002/8174693-tree-full-with-apricots-in-a-garden.jpg",
            "description": "",
            "soil": "Plant the seed in well-drained, loamy soil. Apricots thrive in soil with a pH between 6.5 and 8.0. Well-drained loamy soil is key to your apricot tree growing a strong root system, which will help produce fruit in larger quantities.",
            "climate": "Apricots are best suited to climates with consistently cold winters and short dry springs.  As a Mediterranean crop, apricots grow well where spring and summer are warm and plenty of water is available. Apricot trees as a general rule are fairly hardy. It's just the flowers that can get blasted by a late frost. The tree itself will likely sail through the frosts, but you may not get any fruit.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Cape Gooseberries",
            "watering": "Vegetable",
            "photo": "https://i.pinimg.com/originals/b6/8d/0b/b68d0b1b7774babf79656550a7de37b9.jpg",
            "description": "",
            "soil": "Gooseberries aren't fussy when it comes to soil type, but they do prefer it to be well drained and contain plenty of well-rotted manure or garden compost. The perfect soil for gooseberries is rich, moist and slightly acidic.",
            "climate": "A warm climate, similar to their native South American growing conditions is ideal for Cape Gooseberries. So wait until the soil temperature is 10-25°C to plant them and preferably on the warmer side of this range.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Cantaloupe",
            "watering": "Vegetable",
            "photo": "https://balconygardenweb-lhnfx0beomqvnhspx.netdna-ssl.com/wp-content/uploads/2020/03/cantaloupe-1.jpg",
            "description": "",
            "soil": "Cantaloupes prefer a slightly acidic to neutral soil, between 6.0 and 6.8 pH. They sow seeds in hills, cause the slightly raised mound of soil can keep the heat on your crop, while also providing good drainage.",
            "climate": "Cantaloupes are a warm-weather crop with a long growing season, thriving best in southern or subtropical climates. Cantaloupe is warm-season crop that grow best at average air temperatures between 18 and 23.5 °C. These melons are very tender and should be planted after the last chance of frost.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Figs",
            "watering": "Vegetable",
            "photo": "https://plantingjustice.org/wp-content/uploads/2022/03/deta92.jpg",
            "description": "",
            "soil": "Fig trees grow best in well-drained, organically-rich soils, but they will grow on many other soil types and are tolerant of heavy clay soils if drainage is good. In soil with low fertility or compact clay it'll be worth your time to mix in some organic compost to the native soil. A light, fertile sandy loam is ideal, however a fig will adapt to virtually any soil conditions, with the exception of waterlogged situations. All types of fig trees like reliable moisture. The best way to ensure moisture stability is to keep your tree well mulched.",
            "climate": "They thrive in areas with long, hot summers and mild winters. In tropical areas generally, figs thrive between 800-1,800 m.  It should have a dry climate with light early spring rains if it is intended for the production of fresh fruit.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Grapefruit",
            "watering": "Vegetable",
            "photo": "https://i.ebayimg.com/images/g/naQAAOSwI51fi8Iy/s-l400.jpg",
            "description": "",
            "soil": "Grapefruit trees on sour orange rootstock are well-adapted to deep, well-drained soils. Loamy soils are preferred while heavy clays and poorly-drained soils will result in poor growth and production as well as shorter life.",
            "climate": "Grapefruit trees prefer low or moderate rainfall with cool winters and warm to hot and dry summers. The best temperature range to grow a successful grapefruit tree is between 15.5 and 29.5 degrees Celsius.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Golden Kiwifruit",
            "watering": "Vegetable",
            "photo": "http://cdn.shopify.com/s/files/1/0305/2968/3595/products/Kiwi_1200x1200.jpg?v=1611743798",
            "description": "",
            "soil": "Deep, rich, well-drained sandy loam soils are ideal for cultivation of kiwi. A soil pH slightly less than 6.9 results in maximum yield but higher pH upto 7.3 adversely affects the yield due to Mn deficiency. Kiwi plants prefer slightly acidic soil but will tolerate neutral soils.",
            "climate": "Gold kiwi fruits thrive in fertile soils and mild temperate climates, typical of many coastal and Southern regions throughout Italy. Kiwifruit grow well in hot summer areas with maximum temperatures up to 45°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Mangoes",
            "watering": "Vegetable",
            "photo": "http://cdn.shopify.com/s/files/1/0062/8532/8445/products/Alphonso_Mango_BB_600x600_37dbdab1-c230-4282-bae8-ae32c400d52c_grande.jpg?v=1631623652",
            "description": "",
            "soil": "Mango grows well on wide variety of soils, such as lateritic, alluvial, sandy loam and sandy. The loamy, alluvial, well-drained, aerated and deep soils (2-2.5 m) rich in organic matter with a pH range of 5.5-7.5 are ideal for mango cultivation.",
            "climate": "The crop is successfully cultivated under conditions which vary from very hot, very humid to cool and dry, to very hot and arid. The trees can survive in swampy conditions for an extended period of time, but will also survive in areas with an annual rainfall of less than 300 mm and temperatures as high as 45 °C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Nectarines",
            "watering": "Vegetable",
            "photo": "https://www.nature-and-garden.com/wp-content/uploads/2018/06/nectarine-tree-fruit.jpg",
            "description": "",
            "soil": "A nectarine tree's ideal growing medium is a well-drained sandy soil that has a pH between 6 and 7. If your soil has poor drainage, plant your nectarine tree in a raised garden bed or a container filled with a sandy, fertile soil or potting mix.",
            "climate": "Nectarine trees grow best in climates with hot summers. In order to grow effectively, most nectarine varieties also require a cold dormancy period with winter temperatures below 42 degrees Celsius.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Peaches",
            "watering": "Vegetable",
            "photo": "https://cdn.shopify.com/s/files/1/0158/9452/products/ContenderPeachMaturePMG.jpg?v=1616527794",
            "description": "",
            "soil": "Although fruit trees can be grown on a range of soil types from sand to clay, they thrive best in sandy loam topsoil that is 46 to 61 cm deep underlaid with a brightly colored, well-drained clay subsoil. Shallow or poorly drained soils will produce smaller, weaker trees with lower yields.",
            "climate": "Peach trees grow best in climates with hot summers and winter temperatures colder than 7°C. Most peach varieties require time in cold temperatures in order to grow effectively.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Pears",
            "watering": "Vegetable",
            "photo": "https://gardenerspath.com/wp-content/uploads/2020/10/Best-Fruiting-Pear-Trees-to-Grow-at-Home-Featured.jpg",
            "description": "",
            "soil": "Pear trees grow best in well-drained sandy loam soil that has a pH between 6.0 – 6.5 (although they can also tolerate soils with a pH of 5.0-7.5). However they can also survive in other soils as long as they are well-draining.",
            "climate": "Plant your pear trees in a sunny location to maximize fruit production. Additionally, make sure the area offers good air circulation. Locations away from other trees and large structures are ideal.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Persimmons",
            "watering": "Vegetable",
            "photo": "https://www.trees.com/wp-content/uploads/2019/10/Persimmon-in-fall.jpg",
            "description": "",
            "soil": "Persimmons have a reputation for being very easy to grow, tolerating many conditions. They do well in a wide range of soil types, but favour deep, well-drained loam soils with a good supply of organic matter.",
            "climate": "Persimmon is a deciduous fruit tree which is predominantly cultivated in sub-tropical and warm temperate regions. Like many other fruiting trees and fruit-producing plants, persimmon trees grow best in full sun. However, partial shade may be tolerated, particularly afternoon shade in areas where intense sunlight and heat may cause plants stress.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Pineapples",
            "watering": "Vegetable",
            "photo": "https://media.istockphoto.com/photos/pineapple-plant-picture-id524687723?k=20&m=524687723&s=612x612&w=0&h=Keon9_nfCxWqNfBbgft38eEDgDnlENa6tEHl-RX2yYs=",
            "description": "",
            "soil": "Pineapples, which are related to bromeliads, need sandy, loamy soil with a pH of 4.5 to 6.5. A cactus and citrus potting mix is ideal. An orchid mix made with one-part peat, one-part coarse sand, and one-part perlite also works. The best soils for pineapple production are non-compacted, well-aerated and free-draining loams, sandy loams and clay loams with no heavy clay or rock within one metre of the surface.",
            "climate": "As it is indigenous to the tropics, the crop requires areas where the climate is warm, humid and free from extreme temperatures (25 °C being optimal). These areas have a great potential for pineapple production. Pineapples thrive in warm conditions between 20°C – 30°C. Pineapple plants grow best when they get at least six hours of sunlight daily.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Tangerines",
            "watering": "Vegetable",
            "photo": "https://thumbs.dreamstime.com/b/tangerine-tree-ripe-mandarin-hanging-branch-beautiful-healthy-juicy-fruit-growing-sunny-garden-organic-citrus-outdoors-246375062.jpg",
            "description": "",
            "soil": "Tangerine trees like a neutral soil pH, so it's a good idea to wash off as much of the peat around the root ball as you can. Most good potting soils are already neutral and the addition of peat can drive the pH into the acid range. Place your tree into the pot and fill the area around the roots with soil.",
            "climate": "Tangerines prefer a southern climate with light, welt-drained soils that are moist but not wet. Full sun is necessary, as is supplemental watering in hot weather. A sheltered location from prevailing winds is desirable.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Watermelon",
            "watering": "Vegetable",
            "photo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQwD0_kotxuXko5JCH3odwXU-NfjfuPmUoz4Q&usqp=CAU",
            "description": "",
            "soil": "Melons grow best on well-drained, sandy loam soils, with a pH between 6.0 and 6.5. Soils with a pH less than 6.0 will produce plants with yellow foliage that set few or no fruit. You can improve your soil by adding well-rotted manure or compost in spring or fall.",
            "climate": "Watermelons are plants grown from tropical to temperate climates, needing temperatures higher than about 25 °C to thrive.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Butternut Squash",
            "watering": "Vegetable",
            "photo": "https://www.treehugger.com/thmb/yHB0OTUAiHCgMXtDZ2aZrzn_RaU=/4010x2677/filters:no_upscale():max_bytes(150000):strip_icc()/how-to-grow-butternut-squash-5118507-01-7d6aff65ea944678887eebf4aaa1f164.jpg",
            "description": "Choose a sunny, well-draining spot. Butternut squash will do best in any area that gets full sun. Butternut squash plants are annuals that grow in almost any climate.",
            "soil": "Butternut squash prefers well-draining soil that's rich in organic matter. Like most veining vegetables, squash grows best in sandy, fertile soils with a pH between 6.0 and 6.5.",
            "climate": "",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Peppers",
            "watering": "Vegetable",
            "photo": "http://kvkpravara.com/wp-content/uploads/2021/09/Bell-Peppers-in-Polyhoues.jpg",
            "description": "",
            "soil": "Bell peppers prefer a rich soil that's more sandy or loamy, which keeps your ground conditions well-drained and warm. Bell peppers also like a soil pH between 6.0 and 6.8.",
            "climate": "Bell peppers need full sun to grow and ripen properly, so keep them in a sunny spot in your vegetable garden—unless you live in a climate susceptible to extremely high heat and intense sunlight, in which case shade cloth or nearby plants can be used to manage temperatures. Peppers thrive when temperatures are warm. Being sensitive to the cold, planting should be delayed until the danger of frost is past in the spring. Ideal temperatures are 21°C to 26.5°C during the day, and 15.5°C to 21°C at night.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Potatoes",
            "watering": "Vegetable",
            "photo": "https://aroundkarenshouse.files.wordpress.com/2012/06/hpim0595.jpg",
            "description": "",
            "soil": "Yellow Potatoes grow best in well-draining soil that's loose and easily dug. If your soil is dense, heavy and compacts easily, amend it with organic matter such as compost to loosen it while also improving fertility. ",
            "climate": "Potatoes are native to tropical mountains and are easiest to grow in cool (below 21˚ C) dry weather. They can't stand any frost and don't like cold weather. They are grown in mild winter areas, with few frosts. Potatoes don't do well in hot weather either.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Pumpkin",
            "watering": "Vegetable",
            "photo": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/pumpkin-plants-1656450678.jpg?crop=0.5625xw:1xh;center,top&resize=640:*",
            "description": "",
            "soil": "Pumpkins can be grown successfully on almost any good soil where they will receive full sunlight throughout the day. Sandy soils high in organic matter are best because the soul will warm up fast and drain quickly. If the soil is heavy (clay), it might help to add sand and organic matter.",
            "climate": "Pumpkins are very “tender” vegetables that are highly susceptible to cold temperatures and frost, which can cause them to soften and rot before harvest time. Pumpkins can actually tolerate short periods of hot, dry weather quite well.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Summer Squash",
            "watering": "Vegetable",
            "photo": "https://www.southernexposure.com/media/products/originals/squash-yellow-crookneck-b0dbcd848a2e7c9d0cae2db92fc916e6.jpg",
            "description": "",
            "soil": "Summer squash prefer soil with a pH in the range of 6.0 to 6.5. Grow them in an area that has rich, well-drained soil. Give your native soil a nutrient boost by mixing in several inches aged compost or other rich organic matter.",
            "climate": "Crookneck squash grow best in air temperatures of about 18 to 23.5 degrees Celsius. They grow slowly or stop growing in temperatures below 15.5 degrees C. At temperatures of 29.5 degrees C. and above, they produce less fruit and grow more slowly.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Sweet Corn",
            "watering": "Vegetable",
            "photo": "https://www.lovethegarden.com/sites/default/files/content/articles/UK_sweetcorn-ready-to-harvest.jpg",
            "description": "",
            "soil": "Sweet corn grows best in well-drained soil supplied with organic matter, with a pH of 5.8 to 7.0. Improve your soil by adding well-rotted manure or compost in spring or fall.",
            "climate": "Sweet corn grows best between 24 – 30C. Prolonged temperatures above 32C can reduce pollen germination to zero, resulting in failure of kernels to develop on the cob. A few days at 32C can reduce yield by 30%. Below 12C sweet corn seeds can fail to germinate, emergence is reduced, and phosphorous uptake is limited.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Sweet Potatoes",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2020/02/sweet-potatoes-400x300.jpg",
            "description": "",
            "soil": "Soil and Spacing: Sweet potatoes prefer a fertile, well-drained, loose, deep, slightly acidic, fine sandy loam or very sandy soil. A soil pH of 5.5-6.5 is perfect for better growth. Develop problem soils by adding compost/well-rotted manure and organic matter, prior to planting.",
            "climate": "Sweet potatoes grow best where the air temperature remains very warm, from 75° to 95°F (24-35°C) throughout the growing season. Sweet potatoes are best started indoors as early as 12 weeks before they are placed in the garden.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Tomatoes",
            "watering": "Vegetable",
            "photo": "https://www.provenwinners.com/sites/provenwinners.com/files/imagecache/low-resolution/ifa_upload/patio_sunshine_tag.jpg",
            "description": "",
            "soil": "The soil should be rich in organic matter. For best results, add some compost to the soil. The soil pH should be between 6 - 6.8 , well-draining",
            "climate": "You can grow yellow tomatoes in almost any climate, but they do best in warm weather.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Winter Squash",
            "watering": "Vegetable",
            "photo": "https://gardenerspath.com/wp-content/uploads/2018/08/How-to-Grow-Winter-Squash.jpg",
            "description": "",
            "soil": "Squash like a slightly acidic soil: between 6.0 to 6.8 pH is best. Grow them in an area that gets 6 or more hours of sun and has rich, well-drained soil. Give your native soil a nutrient boost by mixing in several inches aged compost or other rich organic matter.",
            "climate": "Squash plants do not tolerate cold temperatures. Any degree of frost will automatically kill the plants. Squash plants thrive in temperatures of 18°C to 29°C. Wait to plant squash seeds outdoors when the air temperature is consistently above 18°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Cauliflower",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2009/03/cauliflower.jpg",
            "description": "",
            "soil": "Cauliflowers do best in very fertile soil, and digging in a bucketful of well-rotted manure or organic matter before planting, and raking in a high potassium general fertiliser. Cauliflower likes to grow in full sun and rich, moist, well-drained soil with a pH between 6 and 7.",
            "climate": "Because weather is a limiting factor for producing cauliflower, the plant grows best in moderate daytime temperatures 21–29 °C, with plentiful sun,",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Garlic",
            "watering": "Vegetable",
            "photo": "https://i.pinimg.com/originals/4a/c7/fd/4ac7fdf0967c5ecc5fa77db60284bb8a.jpg",
            "description": "",
            "soil": "In general, garlic prefers sandy loam soils that drain well during wet periods and hold moisture during dry periods. Soils with high organic matter and good fertility are also ideal. Garlic does not perform well in wet conditions and can rot easily if the soil remains saturated. Garlic grows best in well-drained, moisture-retentive soil with pH between 6.0 and 7.0.",
            "climate": "Garlic requires cool air temperatures of 0-10°C during its first two months of growth when roots are established and bulbs begin to form. Garlic is not affected by hot weather as it matures. This period of cold exposure is known as vernalization. If the garlic plant does not experience a sufficient period of vernalization, it will not produce a bulb.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Ginger",
            "watering": "Vegetable",
            "photo": "https://5.imimg.com/data5/TN/WR/MY-42987627/ginger-plant-500x500.jpg",
            "description": "",
            "soil": "The best soil for ginger is loose, loamy, and rich in organic matter. Loamy soils allow water to drain freely, which will help prevent the rhizomes from becoming waterlogged. Thick mulch can also provide nutrients, retain water, and help control weeds. The ginger plant grows best in deep, loose, well drained soil with a pH of 5.5 to 6.5. The soil should be high in organic matter, available calcium, and nutrients.",
            "climate": "Ginger thrives best in warm, humid climates. Choose a site that provides plenty of light, including 2 to 5 hours of direct sunlight. Ideal spots are also protected from strong winds.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Jerusalem Artichokes",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2021/06/jerusalem-artichoke-helianthus-tuberosus-1.jpg",
            "description": "",
            "soil": "Soil should be moist but well-drained, with soil pH between 5.8 - 6.2. Ground that's waterlogged for extended periods it's the only thing to avoid",
            "climate": "The ideal temperatures for growing a bountiful Jerusalem artichoke crop is between 18 and 32 degrees Celsius. When planting the tubers, temperatures should be a minimum of 10 degrees Celsius.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Beets",
            "watering": "Vegetable",
            "photo": "https://media.istockphoto.com/photos/golden-beets-picture-id187615989?k=20&m=187615989&s=612x612&w=0&h=cznm7XPGqP8ymzk-PIBG2A3ztRjUxK4xteUDzteV9bU=",
            "description": "",
            "soil": "Beets like soil with a pH of between 6.5 and 7. Work a fertilizer containing both nitrogen and phosphorus prior to planting. Rake out any large rocks or clods since they affect the growth of the beet root. ",
            "climate": "Growing Beets. Beets are adapted to grow in cool temperatures, making them a perfect vegetable to plant both in spring and late summer. They thrive when the days are warm (15.5 to 21 degrees) and nights cool (10 to 15.5 degrees). They may go to seed if temperatures drop below 10 degrees for an extended period.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Yellow Onions",
            "watering": "Vegetable",
            "photo": "https://sandiegoseedcompany.com/wp-content/uploads/2021/02/groing-onions-feature-imgjpg-scaled.jpg",
            "description": "",
            "soil": " They grow in a soil that is fertile, well-drained with a pH of 6.0 to 6.8. Improve your native soil by mixing in several inches of aged compost or other rich organic matter. Onions aren't great at taking up water, so it's important to keep soil moist so their shallow roots can drink up.",
            "climate": "Onions are a cool-season crop and can stand temperatures well below freezing. They may be planted from seeds, from small bulbs called sets, or from transplants. Seeding costs the least but takes longer before onions are ready. ",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Potatoes(White Fleshed)",
            "watering": "Vegetable",
            "photo": "https://cdn.shopify.com/s/files/1/0336/7167/5948/products/image-of-baby-white-potatoes-vegetables-14764104056876_400x400.jpg?v=1620673695",
            "description": "",
            "soil": "Potatoes grow best in well-drained, sandy soil. A poorly drained soil is more likely to produce diseased tubers. Have your soil tested. The ideal soil pH level for potatoes is somewhat acidic, between 6 and 6.5, but they will tolerate soil with pH as low as 5.",
            "climate": "Potatoes are a cool season crop; ideal temperatures for crop growth are 18 to 26.5 degrees Celsius during the day and 12.5 to 18 at night. The soil should be cultivated 15 to 20 cm deep in the spring, and large soil clods should be broken up or removed before planting.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Shallots",
            "watering": "Vegetable",
            "photo": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F44%2F2019%2F12%2Fshallots-1244-getty.jpg&q=60",
            "description": "",
            "soil": "Shallots need fertile, well-drained soil enriched with plenty of well-rotted manure or compost. They won't do well on acid soil (below pH 6.5), so reduce acidity by applying lime in autumn and winter. Damp soil makes the crop more prone to fungal diseases.",
            "climate": "Shallots and chives prefer cool weather during the growing period and the best temperature range is 13° to 24°C. They should be grown in full sun, but will tolerate partial shade.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "White Corn",
            "watering": "Vegetable",
            "photo": "http://cdn.shopify.com/s/files/1/0620/2749/7724/products/corn-argent-1.jpg?v=1653088036",
            "description": "",
            "soil": "Corn can tolerate many soil types but prefers well-drained soils with a pH between 5.5 and 7.0. In sandy soils or soils with a low pH, corn may suffer from magnesium deficiency.",
            "climate": "Corn does best with warm, sunny growing weather (23.5–30° C), well-distributed intermittent moderate rains, or irrigation (38 or more cm during the growing season), and 130 or more frost-free days.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Bananas",
            "watering": "Vegetable",
            "photo": "https://www.plantcelltechnology.com/product_images/uploaded_images/banana-tree.jpg",
            "description": "",
            "soil": "The soil suitable for banana should be 0.5 1m in depth, rich, well drained, fertile, moisture retentive, containing plenty of organic matter. The range of pH should be 6.5-7.5. Alluvial and volcanic soils are the best for banana cultivation. This means that the soil you use to plant your banana tree should include loamy, sandy soil -- not fine sand that clings together, but larger grains that drain easily -- or a mixture of your garden soil and perlite to improve the drainage.",
            "climate": "Banana plants thrive in tropical regions where the average temperature is 27° C and the yearly rainfall is between 200 and 250 cm. They're happy on an island that doesn't ever see freezing temps, but are still considered subtropical. If you're in an area that is generally warm most of the year, you can have success with bananas.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Dates",
            "watering": "Vegetable",
            "photo": "https://cdn.britannica.com/24/162724-050-6C219853/Date-palm.jpg",
            "description": "",
            "soil": " Well-draining soil is the most important factor to consider when choosing where to plant your date palm. This palm does well in sandy or loamy soils and is tolerant of salt. It prefers a slightly acidic to alkaline soil pH.",
            "climate": "Date palm trees are native to the Mediterranean region and thrive in warm dry or humid climates. Unsurprisingly, the researchers found that most types of palms are clustered in tropical zones. Most palms flourish in areas with mean annual temperatures between 17.5 and 27.5 degrees Celsius, but a few hardy varieties don't mind damp, cold feet.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "White Nectarines",
            "watering": "Vegetable",
            "photo": "https://www.homestratosphere.com/wp-content/uploads/2020/07/arctic-jay-nectarines-july212020-min.jpg",
            "description": "",
            "soil": "A nectarine tree's ideal growing medium is a well-drained sandy soil that has a pH between 6 and 7. If your soil has poor drainage, plant your nectarine tree in a raised garden bed or a container filled with a sandy, fertile soil or potting mix.",
            "climate": "They thrive in climates with hot summers. In order to grow effectively, most nectarine varieties also require a cold dormancy period with winter temperatures below 7 degrees Celsius.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "White Peaches",
            "watering": "Vegetable",
            "photo": "https://lh3.googleusercontent.com/ci/ACqFvF2nqiEVTDMdr17U2Avybs8OrsBs1l4IQo4QvwvSg4ParGMnG-7ZWJaQxONVzqxbCF8M3Bs1ug=s1200",
            "description": "",
            "soil": "Choose a site with well-drained, moderately fertile soil. Peach trees won't do well in areas where soil is compacted or remains constantly wet. Soil pH should be on the slightly-acidic side, between 6 and 6.5.",
            "climate": "White peach trees require wet winters for optimal bud production and hot dry summers for prolific, quality fruit. White peaches will not flourish in Oceanic climates.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Brown Pears",
            "watering": "Vegetable",
            "photo": "https://img.freepik.com/premium-photo/braun-pears-hang-branch-orchard-eco-farm-fruits-products-autumn-harvest_221542-775.jpg?w=2000",
            "description": "",
            "soil": "Preferring warm and nutrient-rich soils that are not too moist or clay-rich, the tree is best placed in sandy, loamy, or humus-rich soil that has a pH between 6.0 – 6.5.",
            "climate": "Most popular varieties thrive in regions where the temperature rarely increases well above 32°C. Some pear farmers also make use of big fans in order to cool the orchard, when the temperature exceeds a certain point.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Avocados",
            "watering": "Vegetable",
            "photo": "https://images.immediate.co.uk/production/volatile/sites/10/2020/01/2048x1365-Grow-Guide-Avocado-GettyImages-1143340157-42b5094.jpg?quality=90&resize=960%2C640",
            "description": "",
            "soil": "Avocados like loose, rich, well-draining soil. Plant in a container that has drainage holes, in good quality potting soil. The soil may need to be sandy to accommodate the tree's large roots and fast draining so that the roots do not succumb to root rot fungus. Avocados need well drained soil, as the plant will not tolerate wet soggy soil, this is also important in the winter time when the ground is cold as well. Avocado trees are acid loving plants. Although they will tolerate a slightly greater pH range they grow best in soils with pH values falling in the very narrow band between 5.8 and 6.3.",
            "climate": "Being a tropical plant, an avocado tree hates growing in anything less than 10 degrees Celsius",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Green Apples",
            "watering": "Vegetable",
            "photo": "https://media.istockphoto.com/photos/apples-on-apple-tree-branch-selective-focus-picture-id1140891901?k=20&m=1140891901&s=612x612&w=0&h=idNzwJuqZyx2VUnX01cQ6L7AqIXU1d-9xqIkzTOSI7Y=",
            "description": "",
            "soil": "Apple trees need well-drained soil, but should be able to retain some moisture. Light- to medium-texured soils are best. Fruit trees struggle in heavy clay soil; poorly drained soils leads to root rot disease. Apples prefer a slightly acidic to neutral soil (pH between 5.8 and 7.0).",
            "climate": "Most of commercial apple tree varieties thrive in cold and wet climate, where a cold winter is followed by cool spring and summer. Abundant sunlight is necessary, as it significantly affects the color of the fruit. Apples grow best in climates where it's cold in winter, moderate in summer and has medium to high humidity. They can tolerate winter temperatures as low as - 40 degrees Celsius.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Green Grapes",
            "watering": "Vegetable",
            "photo": "https://www.ugaoo.com/knowledge-center/wp-content/uploads/2017/03/shutterstock_593769218.jpg",
            "description": "",
            "soil": "A soil pH in the range 5.5 to 6.5 is considered optimum for grapes and generally has better nutrient balance for plant growth than soils that are more acidic or alkaline. Vines will grow from pH 4.0 to 8.5, but a pH below 5.5 and above 8 will depress yields and create vine problems.",
            "climate": "Grapevines thrive best in climates with long warm summers, and rainy winters. Warm weather during the growing period enables grapevine to flower, fruit set and ripen.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Honeydew",
            "watering": "Vegetable",
            "photo": "https://strapi.myplantin.com/large_main_5c77fb7e-41c2-4688-bdf1-726da4fbe4f2.webp",
            "description": "",
            "soil": "Honeydew melons prefer fertile, well-draining soil with organic matter.",
            "climate": "Honeydew is warm-season crop that grow best at average air temperatures between 18 and 23.5 °C. It is best to plant when the soil temperature is at least 15.5 to 18 °C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Kiwifruit",
            "watering": "Vegetable",
            "photo": "https://balconygardenweb-lhnfx0beomqvnhspx.netdna-ssl.com/wp-content/uploads/2020/06/kiwi-1.jpg",
            "description": "",
            "soil": "They grow best in fertile, well-drained, slightly acid soil (pH 5-7) that is rich in organic matter, so dig in plenty of garden compost or well-rotted manure before planting.",
            "climate": "Kiwifruit grow well in hot summer areas with maximum temperatures up to 45°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Limes",
            "watering": "Vegetable",
            "photo": "https://backyardhomesteadhq.com/wp-content/uploads/2022/06/green-limes-on-a-tree-lime-green-tree-hanging-fro-2022-05-11-08-20-50-utc-1.jpg",
            "description": "",
            "soil": "Lime may be planted in medium black, loamy or alluvial soils having perfect drainage and devoid of calcium carbonate layer. Lime trees can grow in soil with a sandy loam or clay loam texture, though the lighter, sandy loam soil is best for the shallow-rooted tree, which is prone to rot in soil that does not drain well.",
            "climate": "Areas with dry climate and low rainfall are best suited for growing limes. Lime trees are among the most cold-sensitive of all citrus trees, growing outdoors only in warm, mild climates. If you've got a sunny window with southern exposure, you can grow lime trees indoors no matter how much snow piles up outside. They are best grown where summers are hot and winter temperatures do not drop below -6.5°C. Limes will not fruit if temperatures drop below -2.5°C after the tree has flowered.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Green Peas",
            "watering": "Vegetable",
            "photo": "https://www.urbanseedling.com/wp-content/uploads/2015/03/vegetables-pea-green-arrow.jpg",
            "description": "",
            "soil": "Peas thrive in fertile, loamy soil that is well-draining. Pea plants are tolerant of most soil conditions, but it is best to avoid heavy clay soil types. They do their best growing in soil with a pH level of between 6.0- and 7.5.",
            "climate": "Peas favour a cool climate with an average temperature range of 10-18 C during its growth period. Seed germination is hampered when the temperature at the time of planting is below 5°C. Peas can tolerate frost at early stages of the growth.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Artichokes",
            "watering": "Vegetable",
            "photo": "https://images.squarespace-cdn.com/content/v1/55103523e4b000acf77c93d1/1649159156443-665P7VL9EX3KD4M7LE35/grow+artichokes",
            "description": "",
            "soil": "Artichokes thrive in full sun to partial shade. They also need light, fertile, well-drained soil—sandy or loam is ideal. Apply lime according to soil test results to maintain soil pH between 6.5 and 7.0. Artichokes can be grown on a wide range of soils but produce best on deep, fertile, well-drained soils. Lighter soils having poor water-holding capacity should be avoided. Artichokes are moderately salt-tolerant.",
            "climate": "Artichokes thrive in areas with mild winters, cool summers and plenty of moisture. Colder zone gardeners can grow artichokes as an annual vegetable or over-winter their perennial varieties in a sheltered area.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Arugula",
            "watering": "Vegetable",
            "photo": "https://sandiegoseedcompany.com/wp-content/uploads/2021/02/Arugula-1.jpg",
            "description": "",
            "soil": "Arugula does best in nutrient-rich, well-drained soil, but will tolerate a wide variety of conditions, making it a great choice for containers, raised beds, or traditional garden beds. It prefers slightly acidic soil with a pH between 6 and 7.",
            "climate": "The ideal temperature range for arugula is between 7 and 18 degrees Celsius. It tolerates frost but doesn't like the high heat of summer. You can extend arugula's growing season somewhat by protecting it from freezes with row covers and from heat with shading.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Asparagus",
            "watering": "Vegetable",
            "photo": "https://cdn.harvesttotable.com/htt/2009/01/23181537/Asparagus-bigstock-Green-Young-Asparagus-Sprouts-298173811-1-scaled.jpg",
            "description": "",
            "soil": "Asparagus grows best in well-drained soils with a pH between 6.5 to 7.0 and does not tolerate extremely acidic soils. It can grow in heavy, medium, or sandy soils, as long as the soils must be well-drained and do not exhibit pooling water after rains.",
            "climate": "During the growing season, asparagus prefers a temperature of 21 to 29.5 degrees Celsius during the day and 15.5 to 21 degrees at night. In the spring, it will begin to grow shoots when the soil temperature reaches 10 degrees. Any frost after the shoots start growing will cause discoloration.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Broccoli",
            "watering": "Vegetable",
            "photo": "https://www.ruralsprout.com/wp-content/uploads/2022/04/grow-broccoli-hero.jpg.webp",
            "description": "",
            "soil": "Growing broccoli is done best in soils that are well-drained with a texture between sandy and clay loam. Broccoli and other cruciferous vegetables grow best in soil with a slightly acidic to slightly alkaline pH, pH 6.8-7.4.",
            "climate": "Broccoli does best when temperatures remain between 4.5 degrees and 21 degrees C. It needs to mature during cool periods, so it does well in most areas if planted in late summer to mature in fall. In spring, broccoli is planted early enough to mature during cool weather. Broccoli grows best in full sun.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Brussels Sprouts",
            "watering": "Vegetable",
            "photo": "https://westonseeds.com/wp-content/uploads/2021/01/Brussel-Sprouts.jpg",
            "description": "",
            "soil": "Grow Brussels sprouts in well-drained yet moisture-retentive, fertile soil with pH of 6 to 7. Brussels sprouts like a loamy, well-drained soil that's rich in organic matter. It's ideal to mix a thick layer of compost into the soil prior to planting. The soil pH should hover around neutral.",
            "climate": "Growing Brussels sprouts requires cool weather. They thrive in temperatures between 7-23.5°C, and can survive short periods down to -6.5°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Chinese Cabbage",
            "watering": "Vegetable",
            "photo": "https://www.johnnyseeds.com/on/demandware.static/-/Library-Sites-JSSSharedLibrary/default/dw748f6131/images/culture/88-cabbage-chinese.jpg",
            "description": "",
            "soil": "Grow Chinese cabbage and bok choy in well-drained yet moisture-retentive, fertile soil with pH of 6.0 to 7.5. A good crop needs this ideal garden soil. It is not worth growing cabbage unless the plants absorb water and nutrients steadily during their growth.",
            "climate": "Chinese cabbage thrives best during the cooler periods of the growing season. Although the optimal temperature range of Chinese cabbage development is between 13 and 15 °C, certain cultivars tolerate the higher temperatures of midseason.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Green Beans",
            "watering": "Vegetable",
            "photo": "https://brownthumbmama.com/wp-content/uploads/2020/01/frenchFilet.jpg",
            "description": "",
            "soil": "Beans grow best in slightly acidic to neutral soil, pH between 6 and 7. Clay or silt loams are better for bean production than sandy soils, although good drainage is important. Use well-rotted manure or compost at planting to increase soil organic matter.",
            "climate": "Green beans are a warm season crop that can be planted as soon as the danger of frost has passed in the spring. Green beans grow best when air temperatures range from 18°C to 29°C. Soil temperatures should be at least 12.5°C for good seed germination.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Green Cabbage",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2009/03/cabbage.jpg",
            "description": "",
            "soil": "Grow cabbage in well-drained yet moisture-retentive, fertile soil with a pH of 6 to 7. Improve your soil by adding well-rotted manure or compost in spring or fall. Do not use fresh manure as it may contain harmful bacteria, and may increase weed problems.",
            "climate": "Cabbage prefers cooler growing temperatures, between 13-24°C, optimum being 16-21°C, but will produce good crops under warmer, summer conditions. FALL CROP: Use midseason and storage varieties.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Celery",
            "watering": "Vegetable",
            "photo": "https://i.ytimg.com/vi/WC2ZupdKbm0/hqdefault.jpg",
            "description": "",
            "soil": "Celery prefers soil with a pH between 5.8 and 6.8. Celery loves a nutritious soil that has been enriched with plenty of compost or well-rotted manure.",
            "climate": "Celery has a low tolerance for heat and prefers a cool, cloudy location where growing temperatures range between 15-21°C. Celery does best in cool weather when nighttime temperatures are around 10 degrees C. and average daytime temperatures stay between 15.5 degrees to 21 degrees C. ",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Cucumbers",
            "watering": "Vegetable",
            "photo": "https://www.mygarden.com/sites/default/files/gurken-anbauen-fehler-1124812468-istock_0.jpg",
            "description": "",
            "soil": "For best yield and quality, the soil pH should be between 6.0 and 6.5, which is slightly acidic. The soil should be moisture retentive yet well drained. Forming raised beds will ensure good drainage, which these crops need. Improve your soil by adding well-rotted manure or compost in spring or fall.",
            "climate": "Cucumbers thrive best at relatively high temperatures, between 23.5 to 29.5 degrees C. The plants do not tolerate frost. Since they are a quick-growing crop, they must be well supplied with moisture and plant nutrients throughout the growing season.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Endive",
            "watering": "Vegetable",
            "photo": "https://gardenerspath.com/wp-content/uploads/2021/02/Green-Endive-Growing-in-the-Garden.jpg",
            "description": "",
            "soil": "Endive and escarole may be grown on a wide range of soil types. Loose fertile loams, and muck soils are best. Soils should provide good water holding capacity and good internal drainage, and a pH of 6.5 and above.",
            "climate": "Endive grows best in full sun. It can tolerate only 2- to 3-hours of sun a day and still produce an edible plant, but the heads won't be as well formed. ",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Leeks",
            "watering": "Vegetable",
            "photo": "https://www.highmowingseeds.com/media/catalog/product/cache/6cbdb003cf4aae33b9be8e6a6cf3d7ad/2/6/2697.jpg",
            "description": "",
            "soil": "Leeks grow best in a fertile and well-drained soil with pH between 6.0 and 7.0, and high organic matter. Leeks do best on a firm soil.",
            "climate": "Leeks grow best in temperatures between 13-24°C. Growth will be slowed by hot weather. Leeks need a sunny, sheltered site with a minimum of eight hours of bright sunlight daily..",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Lettuce",
            "watering": "Vegetable",
            "photo": "https://extension.umd.edu/sites/extension.umd.edu/files/styles/optimized/public/2021-01/hgic_veg_crop_letttuce.jpg?itok=VNyJj3LI",
            "description": "",
            "soil": "While Lettuce plants are not picky about the soil consistency, sandy loam soil with a loose consistency and plenty of organic matter best serves this leafy vegetable. The Lettuce is like well-drained soil that remains moist but never full of water. This plant's soil should have a pH range of 6.0 to 6.7.",
            "climate": "Lettuce is adapted to cool growing conditions with the optimum temperatures for growth of 15.5 to 18°C. At 21 to 26.5°C, the plants flower and produce seed. Lettuce can tolerate a few days of temperatures from 26.5 to 29.5°C, provided that nights are cool.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Okra",
            "watering": "Vegetable",
            "photo": "https://hosted-image-content.s3.us-east-2.amazonaws.com/okra.jpg",
            "description": "",
            "soil": "Soil types for okra production can vary, with loams and sandy loams preferred, but even heavier soils can produce well if the soil drains well enough to prevent water-logging. If soil drainage is less than optimal, then okra will benefit from the use of free-standing raised soil beds. Although okra grows best in soil with a pH between 6.5 and 7.0, it can grow in soil with a pH up to 7.6.",
            "climate": "Okra is a tropical plant requiring warm growing conditions. Night temperatures should be above 12.5 C for good growth. Minimum soil temperature for germination is 15.5 C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Green Peppers",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2008/08/pepper.jpg",
            "description": "",
            "soil": "Bell peppers prefer a rich soil that's more sandy or loamy, which keeps your ground conditions well-drained and warm. Bell peppers also like a soil pH between 6.0 and 6.8.",
            "climate": "Bell peppers need full sun to grow and ripen properly, so keep them in a sunny spot in your vegetable garden—unless you live in a climate susceptible to extremely high heat and intense sunlight, in which case shade cloth or nearby plants can be used to manage temperatures. Peppers may also be grown very successfully in containers. Peppers thrive when temperatures are warm.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Spinach",
            "watering": "Vegetable",
            "photo": "https://luv2garden.com/wp-content/uploads/2020/09/Spinach-Companion-Plants-2.jpg",
            "description": "",
            "soil": "Spinach grows well in soil that is near neutral in pH – between 6.5 and 7.5. It is not a heavy feeder, but performs best in soil that is rich in organic matter. Spinach is rarely troubled by disease problems or pests. ",
            "climate": "Spinach prefers a cool climate. The minimum temperature for seed germination is 2 C with a maximum germination temperature of 30 C and an optimum range of 7 to 24 C. Young plants can withstand temperatures as low as -9 C. Best crop growth occurs at 15 to 20 C with a minimum temperature of 10 C and a maximum of 32 C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Watercress",
            "watering": "Vegetable",
            "photo": "https://www.fs.fed.us/wildflowers/plant-of-the-week/images/watercress/Nasturtium_officinale_plant_lg.jpg",
            "description": "",
            "soil": "While watercress will do well in a variety of soil conditions, its ideal range is between a pH of 6.5-7.5. Potted watercress plants should use a soilless mix containing perlite or vermiculite combined with peat.",
            "climate": "This plant germinates best in cool conditions ( 10-15 C.) but not frigid.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Zucchini",
            "watering": "Vegetable",
            "photo": "https://gardeningtips.in/wp-content/uploads/2022/05/Zucchini-Plant-Problems4.jpg",
            "description": "",
            "soil": "For zucchini plants, you'll want a soil with good drainage and rich in loam, which is a combination of three soils. The ideal soil ratio for a vegetable garden is approximately 40% sand, 40% silt, and 20% clay. Zucchini doesn't require excessively nutrient-rich soil, but it does perform best in soils that are high in organic matter with a soil pH around 6.5.",
            "climate": "Zucchini loves warm weather.Ideal temperature range for growth and fruiting is about 18° to 23.5°C. Zucchini withstands temperatures up to 37.5°C, but growth and fruiting may be diminished at temperatures above 29.5°C, and flowers may drop at high temperatures. Most varieties grow slowly or not at all at temperatures below 15.5°C.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Blackberries",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2009/03/blackberries1.jpg",
            "description": "",
            "soil": "While blackberries can grow in almost any soil, the optimal conditions are loam or sandy loam soils that are high in organic matter with a pH of 5.5-6.5. ",
            "climate": "Blackberries prefer a full sun location with six to eight hours of direct sunshine. Shadier locations will produce nice shrubs but very little fruit.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Blueberries",
            "watering": "Vegetable",
            "photo": "https://backyardberryplants.com/wp-content/uploads/2018/10/NorthlandBlueberry.jpg",
            "description": "",
            "soil": "Blueberries prefer acidic soils. A fail-safe way to grow blueberries in almost any soil is to incorporate peat moss into the planting medium. Blueberries grow best in loamy soil, rich in organic matter. Add peat moss, shredded bark or coco peat in quantities up to 50 percent of total soil volume to minimize stress on root growth and allow excess water to drain away from plant roots.",
            "climate": "Blueberries are typically grown in humid, northern climates that have winter chills and mild summers, conditions that limit their range. But many new varieties are available for lower chill areas, very warm areas and coastal areas. The blueberry now has an enormous range.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Concord Grapes",
            "watering": "Vegetable",
            "photo": "https://minnetonkaorchards.com/wp-content/uploads/2020/08/Concord-Grapes-on-the-Vine.jpg",
            "description": "",
            "soil": "The Concord grape prefers deep, acidic (pH 5.0-6.5), well-drained, sandy soil but will tolerate a wide range of soil types except alkaline and wet.",
            "climate": "The climate in the Midwest is particularly well suited to growing Concord grapes. Grapes require a little more effort than some other fruit, but they are picturesque as well as useful.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Elderberries",
            "watering": "Vegetable",
            "photo": "https://www.starkbros.com/images/dynamic/1945.jpg",
            "description": "",
            "soil": "They grow very well in consistently moist, fertile soils. They can tolerate occasional drought and temporarily wet soils but aren't a good choice for sandy or marshy spots. As for pH, the soil can be either acidic or alkaline, though slightly acidic (5.5 to 6.5) is ideal.",
            "climate": "Elderberry prefers sun to part-shade; they don't want to be overly scorched by the sun in super hot and arid locations. Elderberry isn't picky about its temperature conditions, that being said, it's a plant that would much rather be cool and moist than hot and dry. Though it prefers temperate weather, it does not have any special humidity needs—but it loves rain!",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Figs",
            "watering": "Vegetable",
            "photo": "https://media.istockphoto.com/photos/ripe-fig-fruits-on-the-tree-picture-id504336570?k=20&m=504336570&s=612x612&w=0&h=ctiOQab11H1KThCDtH2nGHFjNYHJMrp9O38cc-1eeGM=",
            "description": "",
            "soil": "Fig trees grow best in well-drained, organically-rich soils, but they will grow on many other soil types and are tolerant of heavy clay soils if drainage is good. In soil with low fertility or compact clay it'll be worth your time to mix in some organic compost to the native soil. Figs tolerate a soil pH of 6.0 to 7.8. If your soil is too acidic, apply agricultural lime annually.",
            "climate": "The plants are deciduous, going dormant over the winter in all but the warmest parts of North America. Fig trees tolerate more cold than many people realize. Mature, dormant plants can survive temperatures as low as -9° to -6.5°C—sometimes even colder—without damage. Figs do grow well in the tropics, almost anywhere in fact. Choose the right variety, give your plants some care and you should be enjoying that rich, syrupy nectar in no time.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Grapes",
            "watering": "Vegetable",
            "photo": "https://cdn.pixabay.com/photo/2014/12/02/03/11/grapes-553462__480.jpg",
            "description": "",
            "soil": "Most experts suggest loamy soil as the best type of soil for grape growing. A crumbly mix of sand, silt, and clay when blended with other soils in the right amounts offers the ideal soil type for grape growing.Grapevines grow in many soil types. Well-drained, deep, fertile loams are excellent, yet grapes thrive on soils containing clay, slate, gravel, shale, and sand. Gravelly soils generally drain well, and they absorb and reflect the sun's warmth, providing heat for the vines.",
            "climate": "Grapevines thrive best in climates with long warm summers, and rainy winters. Warm weather during the growing period enables grapevine to flower, fruit set and ripen. Most types of grapes prefer temperate climates, such as Mediterranean climates.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Plums",
            "watering": "Vegetable",
            "photo": "https://www.gardeningknowhow.com/wp-content/uploads/2020/11/plums-on-the-tree.jpg",
            "description": "",
            "soil": "Plums prefer slightly acid soil (pH 6.0-6.8) and thrive in lightweight loamy, well-draining soil. Plum trees grow and produce the best fruit in well-drained but moist fertile soil that is rich in organic matter, but tolerate a wide range of soils as long as water and nutrients are not limiting and soil pH is adequate. Plums do not do well when planted in clay-heavy soils or in locations where their roots will be constantly wet.",
            "climate": "Plum prefers temperate climate. Choose a planting location that receives full sun—6 to 8 hours of direct sunlight at the very least. Avoid planting in low areas where frost may settle, as the frost can damage your trees.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Black Olives",
            "watering": "Vegetable",
            "photo": "https://www.thespruce.com/thmb/PZvlsLbhVrrMDMFe3kahmwsvo6M=/2122x1412/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1286402426-9c5359b11c984c78a863039e99e1984a.jpg",
            "description": "",
            "soil": "Olive trees like extremely well-draining, rocky soil. Plant your tree in a mix of potting soil and perlite or small rocks. When selecting a container, opt for clay or wood. Plastic containers retain more water, which can be deadly for an olive tree. Olives will live happily in acidic or alkaline soils, but they do not like conditions that become waterlogged. Therefore, free draining soil is essential. If your soil is sandy or lacking in nutrients, try adding a root growth stimulant or fertilizer after planting.",
            "climate": "Olive trees require a Mediterranean-like climate to survive. They need a long, hot summer and a cool, not frigid, winter. A mature tree can survive temperatures down to -9 degrees Celsius for a limited amount of time; sustained cold below -9 degrees can be fatal.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Asparagus",
            "watering": "Vegetable",
            "photo": "https://cdn.shopify.com/s/files/1/0061/1391/9089/products/asparagus-sweet-purple-bundle-of-10.jpg?v=1636695106",
            "description": "",
            "soil": "Asparagus grows best in well-drained soils with a pH between 6.5 to 7.0 and does not tolerate extremely acidic soils. It can grow in heavy, medium, or sandy soils, as long as the soils must be well-drained and do not exhibit pooling water after rains.",
            "climate": "During the growing season, asparagus prefers a temperature of 21 to 29 degrees FCelsius during the day and 15.5 to 21 degrees at night. In the spring, it will begin to grow shoots when the soil temperature reaches 10 degrees. Any frost after the shoots start growing will cause discoloration.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Cabbage",
            "watering": "Vegetable",
            "photo": "https://img.onmanorama.com/content/dam/mm/en/lifestyle/health/images/2019/1/21/purple-cabbage-c.jpg",
            "description": "",
            "soil": "A soil pH below about 5.6 is considered low for most crops. Generally, the ideal pH range is between 6.0 and 7.0.",
            "climate": "Cabbage is best grown in temperatures between 9º-27ºC, but is frost-hardy to temperatures as low as -6.5ºC. Cabbage grown in weather that is either too hot or too cold will bolt without forming a head.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Carrots",
            "watering": "Vegetable",
            "photo": "https://www.fruitionseeds.com/wp-content/uploads/Organic-Cosmic-Purple-Carrot.jpg",
            "description": "",
            "soil": "Plant carrots in loose, well-drained soil that has a good mixture of clay and sand. Carrots are best planted in deep, fertile, well drained, sandy loam soils with a pH of 5.5–7.0. Avoid excessively wet and heavy clay soils. ",
            "climate": "Carrots grow best in cool temperatures of early spring and late fall. Night temperatures of 12.5 degrees C and day temperatures of 23.5 degrees C are ideal for carrots. High temperatures cause poorly colored, low-quality carrots.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Eggplant",
            "watering": "Vegetable",
            "photo": "https://www.growjoy.com/store/pc/catalog/patio_baby_eggplant_plant_1552_detail.jpg",
            "description": "",
            "soil": "Eggplant prefers well-drained, fertile, sandy loam soils with a pH between 5.5 and 7.2. Remove all weeds and till the soil to loosen it to a depth of 15 to 25 cm. The higher the organic matter content of the soil the better, so incorporate a 7.5- to 10-cm layer of compost if possible.",
            "climate": "Given their tropical and subtropical heritage, eggplants do require relatively high temperatures. They grow fastest when temperatures are between 21° and 30°C—and very slowly during cooler weather.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Belgian Endive",
            "watering": "Vegetable",
            "photo": "http://specialtyproduce.com/sppics/517.png",
            "description": "",
            "soil": "Belgian endive requires a well-drained soil in full sun. Soil with moderate fertility and a pH of 5.8–6.5 is recommended.",
            "climate": " Belgian endive requires a full growing season for its root development.They are cool-weather crops and grow best at temperatures of 15.5–18.3°C. Careful variety selection is important for hot-weather plantings.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        },
        {
            "name": "Purple Peppers",
            "watering": "Vegetable",
            "photo": "https://cdn.shopify.com/s/files/1/2550/8730/products/PepperSweet_PurpleBeauty_pixabay_shopify@2x.jpg?v=1621621520",
            "description": "",
            "soil": "The soil should be deep, rich, and loamy. If yours isn't, amend it with about 2.5 cm of compost. Avoid adding too much nitrogen to the soil, however. Excessive nitrogen can cause the pepper plants to grow too fast, making them more susceptible to disease and less productive.",
            "climate": "Peppers originated in the tropical highlands of Central and South America and grow best with warm (21 to 26.5˚ C) days, cool (12.5 to 18˚ C) nights and high humidity. If the soil gets above 29˚ C in summer it can slow growth. Full sun. In very hot climates they may benefit from light shade.",
            "sowing_time": "",
            "harvest_time": "",
            "height": "",
            "utilization": ""
        }
    ]
}